app/views/problem_categories/show.html.erb

            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
              <% ProblemPost.where(category_id: @category.id).each do |y| %>
---
SELECT "problem_posts".* FROM "problem_posts" WHERE "problem_posts"."category_id" = $1  [["category_id", 7]]