app/controllers/samaritan/events_controller.rb

  def create
    event = current_user.events.create(events_params)
---
INSERT INTO "events" ("name", "scheduled_at", "duration", "location", "coordinator_name", "coordinator_email", "coordinator_phone", "moto", "who_can_participate", "event_cost", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"