app/views/events/_participant_form.html.erb

SELECT "participants".* FROM "participants" WHERE "participants"."event_id" = $1  [["event_id", 1]]
---
				<div class="comment-main-level">
				<% Participant.where(event_id: @Ievent.id).each do |y| %>