app/controllers/organization/organizations_controller.rb

SELECT  "volunteers".* FROM "volunteers" WHERE "volunteers"."organization_id" = $1 LIMIT 7 OFFSET 0  [["organization_id", 1]]
SELECT  "event_portfolios".* FROM "event_portfolios" LIMIT 5 OFFSET 0
---
 def dashboard
if user_signed_in? && current_user.organization?
@volunteers=current_user.organization.volunteers.page(params[:page]).per(7)
end

@events=EventPortfolio.page(params[:page]).per(5)