app/views/problem_posts/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 26]]
---
				<div class="comment-main-level">
				<% Comment.where(post_id: @post.id).each do |y| %>