app/views/problem_posts/index.html.erb

                        <h4 class="post-subtitle">
                           category: <%= link_to ProblemCategory.find(y.category_id).name_category, problem_category_path(y.category_id) %>
---
SELECT  "problem_categories".* FROM "problem_categories" WHERE "problem_categories"."id" = $1 LIMIT 1  [["id", 2]]