app/controllers/comments_controller.rb

def create
   @comment=Comment.new(comment_params)
   @comment.post_id = params[:problem_post_id]

   respond_to do |format|

      if @comment.save
---
INSERT INTO "comments" ("post_id", "body", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

def set_post
      @post = ProblemPost.find(params[:problem_post_id])
---
SELECT  "problem_posts".* FROM "problem_posts" WHERE "problem_posts"."id" = $1 LIMIT 1  [["id", 29]]