app/controllers/event_portfolios_controller.rb

  def index
   @events = EventPortfolio.page(params[:page]).per(10)
---
SELECT  "event_portfolios".* FROM "event_portfolios" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "event_portfolios"

  def show
   @event = EventPortfolio.find(params[:id])
---
SELECT  "event_portfolios".* FROM "event_portfolios" WHERE "event_portfolios"."id" = $1 LIMIT 1  [["id", 5]]

	def create
   @event=EventPortfolio.new(event_params)


   respond_to do |format|

      if @event.save
---
INSERT INTO "event_portfolios" ("event_name", "organization_name", "event_loc", "coordinator_name", "description", "participants", "highlights", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "event_date", "event_start", "event_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"