app/controllers/events_controller.rb

SELECT  "events".* FROM "events" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "events"
---
  def index
   @Ievents= Event.page(params[:page]).per(10)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
  @Ievent = Event.find(params[:id])