app/controllers/home_controller.rb

SELECT  "problem_posts".* FROM "problem_posts" LIMIT 5 OFFSET 0
SELECT  "event_portfolios".* FROM "event_portfolios" LIMIT 10 OFFSET 0
SELECT  "events".* FROM "events" LIMIT 4 OFFSET 0
---
def home
	@categories=ProblemCategory.all
	 @post = ProblemPost.page(params[:page]).per(4)
	 @events=EventPortfolio.page(params[:page]).per(10)
	 @Ievents=Event.page(params[:page]).per(4)