app/controllers/participants_controller.rb

INSERT INTO "participants" ("event_id", "name", "address", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_id", 1], ["name", "swapni dubey"], ["address", "New palasiya indore"], ["phone", "7895327933"], ["created_at", "2017-05-01 17:11:40.121265"], ["updated_at", "2017-05-01 17:11:40.121265"]]
---
def create
   @participant=Participant.new(participant_params)
   @participant.event_id = params[:event_id]

   respond_to do |format|

      if @participant.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
def set_event
      @Ievent = Event.find(params[:event_id])