app/controllers/problem_categories_controller.rb

     def show
        @category = ProblemCategory.find(params[:id])
        @title=@category.name_category
        @posts = @category.problem_posts.page(params[:page]).per(5)
---
SELECT  "problem_categories".* FROM "problem_categories" WHERE "problem_categories"."id" = $1 LIMIT 1  [["id", 7]]
SELECT "problem_posts".* FROM "problem_posts" WHERE "problem_posts"."category_id" = $1  [["category_id", 7]]