app/controllers/problem_posts_controller.rb

SELECT  "problem_posts".* FROM "problem_posts" WHERE "problem_posts"."id" = $1 LIMIT 1  [["id", 26]]
---
def show
@post = ProblemPost.find(params[:id])

SELECT  "problem_posts".* FROM "problem_posts" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "problem_posts"
---
def index
  @post = ProblemPost.page(params[:page]).per(10)

SELECT  "problem_categories".* FROM "problem_categories" WHERE "problem_categories"."id" = $1 LIMIT 1  [["id", 6]]
---
def new

  @category=ProblemCategory.find(params[:problem_category_id])