app/controllers/volunteers_controller.rb

  def create
    volunteer = Volunteer.create(volunteer_params)
---
INSERT INTO "volunteers" ("first_name", "last_name", "email", "phone_no", "profession", "why_you_joining", "time_contribution", "organization_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"