app/views/layouts/_header.html.erb

                </button>
                 <% if current_user.present? && current_user.organization %>
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."user_id" = $1 LIMIT 1  [["user_id", 6]]